Python 3.13.0 (tags/v3.13.0:60403a5, Oct  7 2024, 09:38:07) [MSC v.1941 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Количество слов в строке: 4

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Количество слов в строке: 6

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Количество слов в строке: 6

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Количество слов в строке: 8

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите первую строку: Компания
Введите вторую строку: IMAX
Строки не являются анаграммами

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите первую строку: Компания
Введите вторую строку: Byte Machine
Строки являются анаграммами

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите число: 5
5 x 1 = 5
5 x 2 = 10
5 x 3 = 15
5 x 4 = 20
5 x 5 = 25
5 x 6 = 30
5 x 7 = 35
5 x 8 = 40
5 x 9 = 45
5 x 10 = 50
5 x 11 = 55
5 x 12 = 60
5 x 13 = 65
5 x 14 = 70
5 x 15 = 75
5 x 16 = 80
5 x 17 = 85
5 x 18 = 90
5 x 19 = 95

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите число: 14
14 x 1 = 14
14 x 2 = 28
14 x 3 = 42
14 x 4 = 56
14 x 5 = 70
14 x 6 = 84
14 x 7 = 98
14 x 8 = 112
14 x 9 = 126
14 x 10 = 140
14 x 11 = 154
14 x 12 = 168
14 x 13 = 182
14 x 14 = 196
14 x 15 = 210
14 x 16 = 224
14 x 17 = 238
14 x 18 = 252
14 x 19 = 266

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите число: 10
10 x 1 = 10
10 x 2 = 20
10 x 3 = 30
10 x 4 = 40
10 x 5 = 50
10 x 6 = 60
10 x 7 = 70
10 x 8 = 80
10 x 9 = 90
10 x 10 = 100
10 x 11 = 110
10 x 12 = 120
10 x 13 = 130
10 x 14 = 140
10 x 15 = 150
10 x 16 = 160
10 x 17 = 170
10 x 18 = 180
10 x 19 = 190

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите количество чисел Фибоначчи: 124
0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946 17711 28657 46368 75025 121393 196418 317811 514229 832040 1346269 2178309 3524578 5702887 9227465 14930352 24157817 39088169 63245986 102334155 165580141 267914296 433494437 701408733 1134903170 1836311903 2971215073 4807526976 7778742049 12586269025 20365011074 32951280099 53316291173 86267571272 139583862445 225851433717 365435296162 591286729879 956722026041 1548008755920 2504730781961 4052739537881 6557470319842 10610209857723 17167680177565 27777890035288 44945570212853 72723460248141 117669030460994 190392490709135 308061521170129 498454011879264 806515533049393 1304969544928657 2111485077978050 3416454622906707 5527939700884757 8944394323791464 14472334024676221 23416728348467685 37889062373143906 61305790721611591 99194853094755497 160500643816367088 259695496911122585 420196140727489673 679891637638612258 1100087778366101931 1779979416004714189 2880067194370816120 4660046610375530309 7540113804746346429 12200160415121876738 19740274219868223167 31940434634990099905 51680708854858323072 83621143489848422977 135301852344706746049 218922995834555169026 354224848179261915075 573147844013817084101 927372692193078999176 1500520536206896083277 2427893228399975082453 3928413764606871165730 6356306993006846248183 10284720757613717413913 16641027750620563662096 26925748508234281076009 43566776258854844738105 70492524767089125814114 114059301025943970552219 184551825793033096366333 298611126818977066918552 483162952612010163284885 781774079430987230203437 1264937032042997393488322 2046711111473984623691759 3311648143516982017180081 5358359254990966640871840 8670007398507948658051921 14028366653498915298923761 22698374052006863956975682 
14
14

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите количество чисел Фибоначчи: 14
0 1 1 2 3 5 8 13 21 34 55 89 144 233 

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите количество чисел Фибоначчи: 33
0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946 17711 28657 46368 75025 121393 196418 317811 514229 832040 1346269 2178309 

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите количество чисел Фибоначчи: 95
0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946 17711 28657 46368 75025 121393 196418 317811 514229 832040 1346269 2178309 3524578 5702887 9227465 14930352 24157817 39088169 63245986 102334155 165580141 267914296 433494437 701408733 1134903170 1836311903 2971215073 4807526976 7778742049 12586269025 20365011074 32951280099 53316291173 86267571272 139583862445 225851433717 365435296162 591286729879 956722026041 1548008755920 2504730781961 4052739537881 6557470319842 10610209857723 17167680177565 27777890035288 44945570212853 72723460248141 117669030460994 190392490709135 308061521170129 498454011879264 806515533049393 1304969544928657 2111485077978050 3416454622906707 5527939700884757 8944394323791464 14472334024676221 23416728348467685 37889062373143906 61305790721611591 99194853094755497 160500643816367088 259695496911122585 420196140727489673 679891637638612258 1100087778366101931 1779979416004714189 2880067194370816120 4660046610375530309 7540113804746346429 12200160415121876738 19740274219868223167 

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите первое число: 24
Введите второе число: 55
НОД чисел 24 и 55: 1

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите первое число: 17
Введите второе число: 40
НОД чисел 17 и 40: 1

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите первое число: 6
Введите второе число: 3
НОД чисел 6 и 3: 3

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Отсортированный список: [1912, 1933, 1941, 1953, 1953, 1990, 2005, 2010, 2012, 2024]

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Отсортированный список: [12, 19, 27, 59, 105, 112]

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Please Enter the total Number of Rows: 10
Inverted Right Triangle Pattern of Numbers
10  10  10  10  10  10  10  10  10  10  
9  9  9  9  9  9  9  9  9  
8  8  8  8  8  8  8  8  
7  7  7  7  7  7  7  
6  6  6  6  6  6  
5  5  5  5  5  
4  4  4  4  
3  3  3  
2  2  
1  

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Please Enter the total Number of Rows: 14
Inverted Right Triangle Pattern of Numbers
14  14  14  14  14  14  14  14  14  14  14  14  14  14  
13  13  13  13  13  13  13  13  13  13  13  13  13  
12  12  12  12  12  12  12  12  12  12  12  12  
11  11  11  11  11  11  11  11  11  11  11  
10  10  10  10  10  10  10  10  10  10  
9  9  9  9  9  9  9  9  9  
8  8  8  8  8  8  8  8  
7  7  7  7  7  7  7  
6  6  6  6  6  6  
5  5  5  5  5  
4  4  4  4  
3  3  3  
2  2  
1  

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Please Enter the total Number of Rows: 24
Inverted Right Triangle Pattern of Numbers
24  24  24  24  24  24  24  24  24  24  24  24  24  24  24  24  24  24  24  24  24  24  24  24  
23  23  23  23  23  23  23  23  23  23  23  23  23  23  23  23  23  23  23  23  23  23  23  
22  22  22  22  22  22  22  22  22  22  22  22  22  22  22  22  22  22  22  22  22  22  
21  21  21  21  21  21  21  21  21  21  21  21  21  21  21  21  21  21  21  21  21  
20  20  20  20  20  20  20  20  20  20  20  20  20  20  20  20  20  20  20  20  
19  19  19  19  19  19  19  19  19  19  19  19  19  19  19  19  19  19  19  
18  18  18  18  18  18  18  18  18  18  18  18  18  18  18  18  18  18  
17  17  17  17  17  17  17  17  17  17  17  17  17  17  17  17  17  
16  16  16  16  16  16  16  16  16  16  16  16  16  16  16  16  
15  15  15  15  15  15  15  15  15  15  15  15  15  15  15  
14  14  14  14  14  14  14  14  14  14  14  14  14  14  
13  13  13  13  13  13  13  13  13  13  13  13  13  
12  12  12  12  12  12  12  12  12  12  12  12  
11  11  11  11  11  11  11  11  11  11  11  
10  10  10  10  10  10  10  10  10  10  
9  9  9  9  9  9  9  9  9  
8  8  8  8  8  8  8  8  
7  7  7  7  7  7  7  
6  6  6  6  6  6  
5  5  5  5  5  
4  4  4  4  
3  3  3  
2  2  
1  

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
CSV-документ создан!

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
(1, 'Виктория', 18)
(2, 'Елизавета', 17)
(3, 'Павел', 24)
(4, 'Виктория', 18)
(5, 'Елизавета', 17)
(6, 'Павел', 24)

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Traceback (most recent call last):
  File "C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py", line 4, in <module>
    text = text.translate(str.maketrans('', '', string.punctuation)).lower()
NameError: name 'text' is not defined. Did you mean: 'next'?

= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите текст: Я хожу на производственную практику.
Количество вхождений каждого слова:
'я': 1
'хожу': 1
'на': 1
'производственную': 1
'практику': 1
>>> 
= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите текст: У меня все получается.
Количество вхождений каждого слова:
'у': 1
'меня': 1
'все': 1
'получается': 1
>>> 
= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите текст: У меня скоро день рождения!!!
Количество вхождений каждого слова:
'у': 1
'меня': 1
'скоро': 1
'день': 1
'рождения': 1
>>> 
= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите число: 44580
Число не является палиндромом.
>>> 
= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Введите число: 123321
Число является палиндромом.
>>> 
= RESTART: C:/Users/vlad_/AppData/Local/Programs/Python/Python313/My Project 3.py
Понедельник:
  - 8:00 - 9:30 - Комп. графика
  - 9:40 - 10:50 - Экономика
  - 11:05 - 12:55 - Основы права

Вторник:
  - 8:00 - 9:30 - Физкультура
  - 9:40 - 10:50 - ИКТ
  - 11:05 - 12:55 - Охрана труда

Среда:
  - 8:00 - 9:30 - Физкультура
  - 9:40 - 10:50 - Экономика
  - 11:05 - 12:55 - Электроника

Четверг:
  - 8:00 - 9:30 - Основы программирования
  - 9:40 - 10:50 - Политология
  - 11:05 - 12:55 - Этика и общения

Пятница:
  - 8:00 - 9:30 - Культурология
  - 9:40 - 10:50 - Робототехника
  - 11:05 - 12:55 - Электротехника

